package org.cryptanalyzer;

import java.util.Arrays;
import java.util.List;

public class Constants {
    public static final List<Character> ALPHABET = Arrays.asList(
            'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я',
            'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я',
            '.', ',', '-', '"', '–', ':', '!', '?', ' ');
    public static final List<String> WORDS = Arrays.asList(
            "и", "в", "не", "он", "на", "я", "что", "тот", "быть", "с", "а", "весь", "это", "как", "она", "по", "но", "они", "к", "у",
            "ты", "из", "мы", "за", "вы", "от", "так", "же", "сказать", "этот", "который", "мочь", "знать", "до", "над", "для", "со", "же", "же",
            "или", "если", "уже", "бы", "очень", "быть", "чтобы", "только", "ещё", "нет"
    );
}
